snlkuharlocal/src/InformationRegisters/ФР_СтатусыОбмена/ФР_СтатусыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФР_СтатусыОбмена</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ЗаявкаНаИзменениеНоменклатурнойГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыОбмена/СтатусыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбмена</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
    <comment>К отправке</comment>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
    <comment>Получено</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ФР_СтатусыОбмена/ManagerModule.bsl
Процедура УстановитьСтатус(Объект,Статус,Знач КодУзлаОтправителя="",Знач КодУзлаПолучателя="") Экспорт	
	МЗ			= РегистрыСведений.ФР_СтатусыОбмена.СоздатьМенеджерЗаписи();
	
	МЗ.Период		= ТекущаяДата();
	МЗ.Объект   	= Объект;
	
	Если Статус=Перечисления.СтатусыОбмена.КОтправке
		ИЛИ Статус=Перечисления.СтатусыОбмена.Отправлено  Тогда
		МЗ.Отправитель  = ОбщегоНазначения_ПИ.ЭтотУзелКод();
		МЗ.Получатель	= КодУзлаПолучателя;
	Иначе
		МЗ.Отправитель  = КодУзлаОтправителя;
		МЗ.Получатель	= ОбщегоНазначения_ПИ.ЭтотУзелКод();
	КонецЕсли;
	
	МЗ.Статус		= Статус;
	
	МЗ.Записать();
КонецПроцедуры
